clc
clear all
close all
 
l1=501; %размеры звеньев 
l2=400;
l3=326;
l4=10;
l5=105;
l33=100;

syms x1 x2 x3 x4 x5 x6 

R1=[
     cos(x1) 0 sin(x1) 0 ;
      0      1       0 0 ;
    -sin(x1) 0 cos(x1) 0 ;
      0      0       0 1 ]; %матрица поворота первого звена           
           
 R2=[
        cos(x2) -sin(x2) 0 0;
        sin(x2) cos(x2) 0 0 ;
        0 0 1 0 ;
        0 0 0 1         ] ; 
           
  R3=[
        cos(x3) -sin(x3) 0  0;
        sin(x3) cos(x3) 0   0 ;
            0       0   1   0 ;
            0       0   0   1  ]; 
        
  R4=[
             1       0    0 0 ;
             0 cos(x4) -sin(x4)  0 ;
             0 sin(x4) cos(x4)   0 ;
             0       0    0 1  ]  ; 
           
           
   R5=[
        cos(x5) -sin(x5) 0 0;
        sin(x5) cos(x5) 0 0 ;
        0 0 1 0 ;
        0 0 0 1  ];
           
    R6=[
             1       0    0 0 ;
             0 cos(x6) -sin(x6)  0 ;
             0 sin(x6) cos(x6)   0 ;
             0       0    0 1  ]  ;
         
         
         
     P1=[               %матрица перемещения первого звена
         1 0 0 0
         0 1 0 l1
         0 0 1 0
         0 0 0 1      ];           
     
      P2=[
         1 0 0 l2
         0 1 0 0
         0 0 1 0
         0 0 0 1      ];
     
     P3=[
         1 0 0 l3/2
         0 1 0 0
         0 0 1 l33
         0 0 0 1      ];
     
      P4=[
         1 0 0 l3/2
         0 1 0 0
         0 0 1 0
         0 0 0 1      ];
     
     P5=[
         1 0 0 l4
         0 1 0 0
         0 0 1 0
         0 0 0 1      ];
     
      P6=[
         1 0 0 l5
         0 1 0 0
         0 0 1 0
         0 0 0 1      ];   
     
      T=(R1*P1)*(R2*P2)*(R3*P3)*(R4*P4)*(R5*P5)*(R6*P6) 
      %результирующая матрица 
      
      
      
      